let page = "home";

function goto(route) {
  document.querySelector(`#${page}`).style.display = "none";
  page = route;
  document.querySelector(`#${page}`).style.display = "flow-root";
  if (route == 'result') {
    document.querySelector('.gohome').style.display = "block";
  } else if (route == 'home') {
    document.querySelector('.gohome').style.display = "none";
  }
  else {
    document.querySelector('.gohome').style.display = "block";
  }
}

// 座位信息
const seats = {
  "裴德贵": {
    "3月3日下午": "舞台前沙发位第六座",
    "3月3日晚宴": "B2",
  },
  "张楠": {
    "3月3日下午": "舞台前沙发位第四座",
    "3月3日晚宴": "D4",
  },
  "焦龙": {
    "3月3日下午": "舞台前沙发位第八座",
    "3月3日晚宴": "D4",
  },
  "王武": {
    "3月3日下午": "舞台前沙发位第九座",
    "3月3日晚宴": "D4",
  },
  "刘国奇": {
    "3月3日下午": "舞台前沙发位第二座",
    "3月3日晚宴": "D4",
  },
  "朱淑云": {
    "3月3日下午": "舞台前沙发位第五座",
    "3月3日晚宴": "D4",
  },
  "卜训芳": {
    "3月3日下午": "舞台前沙发位第七座",
    "3月3日晚宴": "D4",
  },
  "张涛": {
    "3月3日下午": "舞台前沙发位第三座",
    "3月3日晚宴": "D4",
  },
  "谭燕": {
    "3月3日下午": "舞台前沙发位第十座",
    "3月3日晚宴": "D4",
  },
  "张思娜": {
    "3月3日下午": "舞台前沙发位第一座",
    "3月3日晚宴": "D4",
  },




  "王晓美": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "陈玉坤": {
    "3月3日下午": "一排，二座",
    "3月3日晚宴": "D4",
  },
  "黄丽": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "吴起云": {
    "3月3日下午": "一排，一座",
    "3月3日晚宴": "D4",
  },
  "王成岚": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "周杰": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "柏小红": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "胡晴晴": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },


  "蔡金玉": {
    "3月3日下午": "一排，十三座",
    "3月3日晚宴": "D4",
  },
  "梅国涛": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "赵文": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "吕丽利": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "李园园": {
    "3月3日下午": "一排，七座",
    "3月3日晚宴": "D4",
  },
  "刘明信": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "刘伟": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "杨超": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "王传琴": {
    "3月3日下午": "一排，六座",
    "3月3日晚宴": "D4",
  },
  "陶晨": {
    "3月3日下午": "一排，四座",
    "3月3日晚宴": "D4",
  },
  "徐慧侠": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "袁丽": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "石心茹": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "孟浩": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "陈菲": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "葛晓蕾": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },




  "王磊": {
    "3月3日下午": "一排，十二座",
    "3月3日晚宴": "D4",
  },
  "何银龙": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "阮海波": {
    "3月3日下午": "一排，九座",
    "3月3日晚宴": "D4",
  },
  "章霞": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "刘坤": {
    "3月3日下午": "一排三座",
    "3月3日晚宴": "D4",
  },
  "黄育群": {
    "3月3日下午": "一排，五座",
    "3月3日晚宴": "D4",
  },
  "孙智群": {
    "3月3日下午": "一排，十一座",
    "3月3日晚宴": "D4",
  },
  "陈腾腾": {
    "3月3日下午": "一排，十座",
    "3月3日晚宴": "D4",
  },
  "王志恒": {
    "3月3日下午": "一排，八座",
    "3月3日晚宴": "D4",
  },
  "仲伟楠": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "刘勇": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "查鹏": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "许小艳": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "闫利平": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "黎婷婷": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "曹营营": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "王广红": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },



  "汪瑾": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "程菲": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "仰孝华": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "朱世芝": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "于树霞": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "熊立志": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "李红平": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "胡瑰": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "何正英": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "曹阳葵": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },




  "孙成倩": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "董婷婷": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "王红梅": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "王翠明": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "汤纪芬": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "石玉锐": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "李远卓": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "葛少兰": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "高瑶": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "蔡兆红": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },



  "孙中哲": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "张秀芹": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "张蓓": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "余娜": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "张廷": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "赵再妍": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "张鼎": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "颜影": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "吴玉芳": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "王分田": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },




  "朱荣荣": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "朱丽娟": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "赵哲": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "赵修平": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "张倩": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "张彭珍": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "张楠楠": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "张爱云": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "杨丽萍": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "杨坤": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },



  "郭传香": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "谢井荣": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "武永志": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "武燕": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "吴利利": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "韦洪权": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "王一平": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "孙传颍": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "秦娜": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "骆利": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },




  "宋飞扬": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "刘婷婷": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "刘梦冉": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "李玲": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "韩莹莹": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "杜雪萍": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "陈陈": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "和冰": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "崔玲玲": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "周静": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },




  "孙娟": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "刘芳": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "朱小娟": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "赵冰": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "肖艳": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "马玉枝": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "吕华": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4"
  },
  "李晓艳": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "金克欢": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "郭风云": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },




  "苏硕": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "代红红": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "车红霞": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "李浩": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "张雷雨": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "孙明云": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "孙交交": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "付玉侠": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "陈玲莉": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "张媛媛": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },



  "刘怡璇": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "周维庆": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "张梦琪": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "魏海针": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "田传龙": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "滕道芹": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "石文红": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "李春风": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "蒋正宝": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "陈芳": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },




  "周鲁华": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "张云松": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "张静": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "杨维伟": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "吴小翠": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "吴倩文": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "王杰": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "李玉香": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "李倩": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "黄佩佩": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },



  "卢敏": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "李婉": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "韩雪": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "郭腾飞": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "丁一": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "丁梦雨": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "陈洁": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "李晶晶": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "吴婷婷": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "李芹": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },




  "龚盛奇": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "国小波": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "杨丽桃": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "乔振萍": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "吴红梅": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "柯念红": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "陶华幢": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "石磊": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "盛文瑶": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "芮俊": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },



  "方伟": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "陈慧莉": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "曹义": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "胡晓俊": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "芦华芳": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "李光荣": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "李成婷": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "焦迪": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "黄雅琴": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "许安琦": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },




  "张皋丰": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "王鸿": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "周萍": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "张恒": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "袁德亮": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "吴显峰": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "林杰": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "李性华": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "程国庆": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "陈浩": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },




  "刘琴": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "杨健": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "霍守辰": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "王琪": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },
  "": {
    "3月3日下午": "C3",
    "3月3日晚宴": "D4",
  },

  // 可以添加更多人的座位信息...
};

function querySeats() {
  goto('result');

  const nameInput = document.getElementById('name');
  const name = nameInput.value;

  const resultDiv = document.getElementById('res_main');
  resultDiv.innerHTML = '';

  if (seats[name]) {
    const seatsInfo = seats[name];

    const table = document.createElement('table');
    const headerRow = table.insertRow();
    const headerCell1 = headerRow.insertCell();
    headerCell1.innerHTML = '日期';
    const headerCell2 = headerRow.insertCell();
    headerCell2.innerHTML = '座位号';

    for (const date in seatsInfo) {
      const row = table.insertRow();
      const cell1 = row.insertCell();
      cell1.innerHTML = date;
      const cell2 = row.insertCell();
      cell2.innerHTML = seatsInfo[date];
    }
    document.querySelector("#res_name").innerHTML = name;
    resultDiv.appendChild(table);
  } else {
    resultDiv.innerHTML = `<p style="text-align:center">未找到 "${name}" 的座位信息。</p>`;
  }
}

